In [1]:
import pandas as pd

In [3]:
data = {
'2021' : [1116, 12259, 16699, 65119],
'2020' : [628, 11075, 15695, 56013],
'2019' : [678,12700,15148,55443],
'2018' : [712, 13597, 16052, 56024],
'농지면적순위' : [4,3,2,1]
}
columns = ['농지면적순위', '2021', '2020', '2019', '2018']
index = ['서울','부산','대구','인천']
df = pd.DataFrame(data, index=index, columns=columns)
df

    농지면적순위   2021   2020   2019   2018
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [4]:
df.columns

Index(['농지면적순위', '2021', '2020', '2019', '2018'], dtype='object')

In [5]:
df.index

Index(['서울', '부산', '대구', '인천'], dtype='object')

In [6]:
df.values

array([[    4,  1116,   628,   678,   712],
       [    3, 12259, 11075, 12700, 13597],
       [    2, 16699, 15695, 15148, 16052],
       [    1, 65119, 56013, 55443, 56024]], dtype=int64)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 인천
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   농지면적순위  4 non-null      int64
 1   2021    4 non-null      int64
 2   2020    4 non-null      int64
 3   2019    4 non-null      int64
 4   2018    4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [9]:
df.index.name = '지역'

In [10]:
df

    농지면적순위   2021   2020   2019   2018
지역
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [11]:
df.columns.name = '특성'

In [12]:
df

특성  농지면적순위   2021   2020   2019   2018
지역
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [15]:
df['2018-2021 변화율'] = ((df['2021'] - df['2018'])/df['2018']*100)
df

특성  농지면적순위   2021   2020   2019   2018  2018-2021 변화율
지역
서울       4   1116    628    678    712      56.741573
부산       3  12259  11075  12700  13597      -9.840406
대구       2  16699  15695  15148  16052       4.030650
인천       1  65119  56013  55443  56024      16.234114

In [16]:
df.T

지역                      서울            부산           대구            인천
특성
농지면적순위            4.000000      3.000000      2.00000      1.000000
2021           1116.000000  12259.000000  16699.00000  65119.000000
2020            628.000000  11075.000000  15695.00000  56013.000000
2019            678.000000  12700.000000  15148.00000  55443.000000
2018            712.000000  13597.000000  16052.00000  56024.000000
2018-2021 변화율    56.741573     -9.840406      4.03065     16.234114

In [19]:
df[['2018', '2021']]

특성   2018   2021
지역
서울    712   1116
부산  13597  12259
대구  16052  16699
인천  56024  65119

In [22]:
# 시리즈로 반환하기에 해당 컬럼에서 인덱스 넘버로 접근가능
print(df['2018'][0])
print(df['2018']['서울'])

712
712

In [24]:
df.sort_values(by='2018-2021 변화율')

특성  농지면적순위   2021   2020   2019   2018  2018-2021 변화율
지역
부산       3  12259  11075  12700  13597      -9.840406
대구       2  16699  15695  15148  16052       4.030650
인천       1  65119  56013  55443  56024      16.234114
서울       4   1116    628    678    712      56.741573

In [29]:
#숫자 인덱스로 단일 row 호출은 불가하지만 슬라이싱은가능
# df[1] <- 불가 오류남
df[:2]

특성  농지면적순위   2021   2020   2019   2018  2018-2021 변화율
지역
서울       4   1116    628    678    712      56.741573
부산       3  12259  11075  12700  13597      -9.840406

In [28]:
df['서울':'부산']

특성  농지면적순위   2021   2020   2019   2018  2018-2021 변화율
지역
서울       4   1116    628    678    712      56.741573
부산       3  12259  11075  12700  13597      -9.840406

In [31]:
# loc, iloc
df.loc[['부산','대구']]

특성  농지면적순위   2021   2020   2019   2018  2018-2021 변화율
지역
부산       3  12259  11075  12700  13597      -9.840406
대구       2  16699  15695  15148  16052       4.030650

In [32]:
df.iloc[0]

특성
농지면적순위              4.000000
2021             1116.000000
2020              628.000000
2019              678.000000
2018              712.000000
2018-2021 변화율      56.741573
Name: 서울, dtype: float64

In [36]:
type(df.iloc[0,0])

numpy.int64

In [37]:
type(df.iloc[0][0])

numpy.float64

In [39]:
data = {
'국어' : [80,90,70,50],
'영어' : [90,50,60,100],
'수학' : [70,100,50,70],
'과학' : [30,50,80,80]
}
columns = ['국어','영어','수학','과학']
index = ['철수','영희','길동','슬기']
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어   영어   수학  과학
철수  80   90   70  30
영희  90   50  100  50
길동  70   60   50  80
슬기  50  100   70  80

In [59]:
df['평균'] = df.mean(axis=1) # row 평균
df.loc['평균'] = df.mean() # col 평균
df

      국어     영어     수학    과학    평균
철수  80.0   90.0   70.0  30.0  67.5
영희  90.0   50.0  100.0  50.0  72.5
길동  70.0   60.0   50.0  80.0  65.0
슬기  50.0  100.0   70.0  80.0  75.0
평균  72.5   75.0   72.5  60.0  70.0

In [60]:
# row를 삭제할때는 drop
df.drop(['평균'])

      국어     영어     수학    과학    평균
철수  80.0   90.0   70.0  30.0  67.5
영희  90.0   50.0  100.0  50.0  72.5
길동  70.0   60.0   50.0  80.0  65.0
슬기  50.0  100.0   70.0  80.0  75.0

In [61]:
# col을 삭제할때는 del
del df['평균']
df

      국어     영어     수학    과학
철수  80.0   90.0   70.0  30.0
영희  90.0   50.0  100.0  50.0
길동  70.0   60.0   50.0  80.0
슬기  50.0  100.0   70.0  80.0
평균  72.5   75.0   72.5  60.0